In [1]:
import pandas as pd
import numpy as np

In [82]:
df = pd.DataFrame({ 'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
                                'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
                                '12. Air France', '"Swiss Air"']})

In [3]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Ques 1

In [83]:
for i in range(0,len(df)):
    if pd.isnull(df.FlightNumber.loc[i]):
        df.FlightNumber.loc[i]=df.FlightNumber.loc[i-1]+10
       
df['FlightNumber']

C:\Users\hp1\Anaconda3\lib\site-packages\pandas\core\indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

0    10045.0
1    10055.0
2    10065.0
3    10075.0
4    10085.0
Name: FlightNumber, dtype: float64

In [84]:
df.info()
df['FlightNumber']=df['FlightNumber'].astype('int')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
From_To         5 non-null object
FlightNumber    5 non-null float64
RecentDelays    5 non-null object
Airline         5 non-null object
dtypes: float64(1), object(3)
memory usage: 288.0+ bytes

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 8 columns):
FlightNumber    5 non-null int32
RecentDelays    5 non-null object
Airline         5 non-null object
From            5 non-null object
To              5 non-null object
delay_3         1 non-null float64
delay_2         3 non-null float64
delay_1         4 non-null float64
dtypes: float64(3), int32(1), object(4)
memory usage: 428.0+ bytes

In [57]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN       10055.0            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis       10075.0          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# Ques 2

In [85]:
df[['From','To']]=df['From_To'].str.split('_',expand=True)

In [59]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),LoNDon,paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),MAdrid,miLAN
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),londON,StockhOlm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,PaRis
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,londOn

# Ques 3

In [86]:
df['From']=df['From'].str.title()
df['To']=df['To'].str.title()

In [61]:
df

,From_To,FlightNumber,RecentDelays,Airline,From,To
0,LoNDon_paris,10045.0,"[23, 47]",KLM(!),London,Paris
1,MAdrid_miLAN,10055.0,[],<Air France> (12),Madrid,Milan
2,londON_StockhOlm,10065.0,"[24, 43, 87]",(British Airways. ),London,Stockholm
3,Budapest_PaRis,10075.0,[13],12. Air France,Budapest,Paris
4,Brussels_londOn,10085.0,"[67, 32]","""Swiss Air""",Brussels,London

# Ques 4

In [87]:
df.drop(labels='From_To',axis=1,inplace=True)

In [88]:
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

# Ques 5

In [89]:
a=[len(i) for i in df['RecentDelays']]
b=max(a)
for i in range(1,max(a)+1):
    delay='delay_'+ str(i)
    #print(delay)
    df.insert(column=delay,value=np.nan,loc=5)

delay_1
delay_2
delay_3

In [90]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_3,delay_2,delay_1
0,10045,"[23, 47]",KLM(!),London,Paris,NaN,NaN,NaN
1,10055,[],<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,NaN,NaN,NaN
3,10075,[13],12. Air France,Budapest,Paris,NaN,NaN,NaN
4,10085,"[67, 32]","""Swiss Air""",Brussels,London,NaN,NaN,NaN

In [91]:
for i in df['RecentDelays']:
    print(i)
    for j in range(0,b):
        if(len(i)!=b):
            i.append(np.nan)

[23, 47]
[]
[24, 43, 87]
[13]
[67, 32]

In [92]:
df

,FlightNumber,RecentDelays,Airline,From,To,delay_3,delay_2,delay_1
0,10045,"[23, 47, nan]",KLM(!),London,Paris,NaN,NaN,NaN
1,10055,"[nan, nan, nan]",<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,"[24, 43, 87]",(British Airways. ),London,Stockholm,NaN,NaN,NaN
3,10075,"[13, nan, nan]",12. Air France,Budapest,Paris,NaN,NaN,NaN
4,10085,"[67, 32, nan]","""Swiss Air""",Brussels,London,NaN,NaN,NaN

In [93]:
for i in range(0,5):
    #print(df['RecentDelays'][i])
    for j in range(0,3):
        #print(df['RecentDelays'][i][j],df['RecentDelays'][i][j+1],df['RecentDelays'][i][j+2])
        df['delay_1'].iloc[i],df['delay_2'].iloc[i],df['delay_3'].iloc[i]=df['RecentDelays'][i][j],df['RecentDelays'][i][j+1],df['RecentDelays'][i][j+2]
        break

In [94]:
df.drop(labels='RecentDelays',axis=1,inplace=True)

In [95]:
df

,FlightNumber,Airline,From,To,delay_3,delay_2,delay_1
0,10045,KLM(!),London,Paris,NaN,47.0,23.0
1,10055,<Air France> (12),Madrid,Milan,NaN,NaN,NaN
2,10065,(British Airways. ),London,Stockholm,87.0,43.0,24.0
3,10075,12. Air France,Budapest,Paris,NaN,NaN,13.0
4,10085,"""Swiss Air""",Brussels,London,NaN,32.0,67.0